# FabricationSaveJobOptions Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationSaveJobOptions Members
FabricationSaveJobOptions Class Constructors Methods Properties See Also
---
The FabricationSaveJobOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FabricationSaveJobOptions()()()() | Default Constructor |
| FabricationSaveJobOptions(Boolean) | Constructor |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the FabricationSaveJobOptions |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddHolesForTaps | Set true to have holes for taps on straights added to the created fabrication job. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FabricationSaveJobOptions Class
Autodesk.Revit.DB.Fabrication Namespace